Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/удуДоговорОЗачисленииРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуДоговорОЗачисленииРебенка</name>
  <basedOn>Document.удуЗаявкаНаЗачислениеРебенкаВДОУ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоЗачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоОтчисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакФормированияБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиОплаты</name>
    <type>
      <types>EnumRef.удуВидыСтавокРодительскойПлаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Enums/удуВидыСтавокРодительскойПлаты/удуВидыСтавокРодительскойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыСтавокРодительскойПлаты</name>
  <enumValues>
    <name>Дневная</name>
  </enumValues>
  <enumValues>
    <name>Месячная</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуЗаявкаНаЗачислениеРебенкаВДОУ/удуЗаявкаНаЗачислениеРебенкаВДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуЗаявкаНаЗачислениеРебенкаВДОУ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииВОчередь</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоПоступления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЖелаемая</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительПодавшийЗаявку</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаЯвкиРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаЯвкиРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЯвкиРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозможностиНеЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительДляУведомления</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиНаправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительДляНаправления</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОтказаВЗачислении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтказаВЗачислении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВЗачислении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОЛицаСнявшегоЗаявку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоФактуЗачисления</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛьготыПоЗаявке</name>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>CatalogRef.удуЛьготыПоЗачислению</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Catalogs/удуГруппыУчреждения/удуГруппыУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуГруппыУчреждения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вместительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсирующаяНаправленность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезОграниченияВместительности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленностьГруппы</name>
    <type>
      <types>EnumRef.удуТипыНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияНаправленности</name>
    <type>
      <types>CatalogRef.удуДетализацияНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВоспитательныйПерсонал</name>
    <attributes>
      <name>РаботникУчреждения</name>
      <type>
        <types>CatalogRef.удуСотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ОтсутствуютДоговораПоЗаявке(ПереданнаяЗаявка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуДоговорОЗачисленииРебенка.Ссылка
	               |ИЗ
	               |	Документ.удуДоговорОЗачисленииРебенка КАК удуДоговорОЗачисленииРебенка
	               |ГДЕ
	               |	(НЕ удуДоговорОЗачисленииРебенка.ПометкаУдаления)
	               |	И удуДоговорОЗачисленииРебенка.ЗаявкаОснование = &ЗаявкаОснование
	               |	И (НЕ удуДоговорОЗачисленииРебенка.ПризнакФормированияБезЗаявки)
	               |	И удуДоговорОЗачисленииРебенка.Ссылка <> &Ссылка";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗаявкаОснование", ПереданнаяЗаявка);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Булево(Результат.Количество() = 0);	
КонецФункции

&НаСервере
Функция ВЗаявкеНеОтказано(ПереданнаяЗаявка)
	Возврат НЕ ПереданнаяЗаявка.ПризнакОтказаВЗачислении;
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДокументуОснованиюНаСервере(ПараметрОснование)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Группа = ПараметрОснование.ГруппаЖелаемая;
	ДокументОбъект.Ребенок = ПараметрОснование.Ребенок;
	ДокументОбъект.Родитель = ПараметрОснование.РодительПодавшийЗаявку;
	ДокументОбъект.Учреждение = ПараметрОснование.Учреждение;
	ДокументОбъект.ПризнакФормированияБезЗаявки = Ложь;
	ДокументОбъект.ЗаявкаОснование = ПараметрОснование.Ссылка;	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОСоставеГруппы()
	// Отбор по учреждению
	Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда 
		Объект.Учреждение = Объект.Группа.Учреждение;
	КонецЕсли;
	
	сэРезультатВыполнения = удуОбработкаПросмотрИнформации.ПолучитьсоставГруппы(Объект.Группа, ТекущаяДата());		
	ЗначениеВРеквизитФормы(сэРезультатВыполнения, "СоставВыбраннойГруппы");
	
	Если Объект.Группа.БезОграниченияВместительности Тогда
		Элементы.НадписьСведенияОГруппе.Заголовок = "Количество детей в выбранной группе: " + Строка(сэРезультатВыполнения.Количество()) + ". Вместительность группы не ограничена.";
	Иначе
		Элементы.НадписьСведенияОГруппе.Заголовок = "Количество детей в выбранной группе: " + Строка(сэРезультатВыполнения.Количество()) + ". Вместительность группы: " + Строка(Объект.Группа.Вместительность);
	КонецЕсли;
	
	Если Объект.Группа.КомпенсирующаяНаправленность Тогда
		Объект.ОплатаПоДоговору = 0;
		Элементы.ОплатаПоДоговору.Доступность = Ложь;
	Иначе
		Элементы.ОплатаПоДоговору.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда
		Объект.Учреждение = Константы.удуОсновноеУчреждение.Получить();
		Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда
			ЭтаФорма.Элементы.Учреждение.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСведенияОСоставеГруппы();	
	
	Элементы.ЗаявкаОснование.Доступность = НЕ Объект.ПризнакФормированияБезЗаявки;
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НадписьСведенияОГруппеНажатие(Элемент)
	// Вставить содержимое обработчика.
	Если СоставВыбраннойГруппы.Количество() > 0 Тогда 
		ФормаПросмотра = ПолучитьФорму("ОбщаяФорма.удуФормаПросмотраСоставаГруппы");
		ФормаПросмотра.ВладелецФормы = ЭтаФорма;
		Для Каждого СтрокаСоставГруппы Из СоставВыбраннойГруппы Цикл
			НоваяСтрокаФормыПросмотра = ФормаПросмотра.ТабличнаяЧастьДети.Добавить();
			НоваяСтрокаФормыПросмотра.Ребенок = СтрокаСоставГруппы.Ребенок;
			НоваяСтрокаФормыПросмотра.Пол = СтрокаСоставГруппы.Пол;
			НоваяСтрокаФормыПросмотра.ДатаРождения = СтрокаСоставГруппы.ДатаРождения;
		КонецЦикла;
		ФормаПросмотра.ОткрытьМодально();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСведенияОСоставеГруппы();
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Ребенок) Тогда
		ФормаВыбораРодителя = ПолучитьФорму("ОбщаяФорма.удуФормаВыбораРодителя");
		ФормаВыбораРодителя.ПараметрРебенок = Объект.Ребенок;
		ФормаВыбораРодителя.ВладелецФормы = ЭтаФорма;
		ФормаВыбораРодителя.ОткрытьМодально();				
	Иначе
		Вопрос("Перед выбором родителя необходимо выбрать ребенка!", РежимДиалогаВопрос.ОК);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.удуРодители") Тогда
		Объект.Родитель = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ОтсутствуютДоговораПоЗаявке(ВыбранноеЗначение) Тогда
			Если ВЗаявкеНеОтказано(ВыбранноеЗначение) Тогда 		
				Если Вопрос("При изменении документа-основания реквизиты документа будут изменены в соответствии с выбранным значением! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					ЗаполнитьПоДокументуОснованиюНаСервере(ВыбранноеЗначение);
				Иначе
					СтандартнаяОбработка = Ложь;
				КонецЕсли;		
			Иначе
				Вопрос("По выбранной заявке было отказано в зачислении ребенка в группу", РежимДиалогаВопрос.ОК);
				СтандартнаяОбработка = Ложь;
			КонецЕсли;			
		Иначе
			Вопрос("По выбранной заявке уже сформирован договор о зачислении ребенка в группу", РежимДиалогаВопрос.ОК);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакФормированияБезЗаявкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Элементы.ЗаявкаОснование.Доступность = НЕ Объект.ПризнакФормированияБезЗаявки;
	
	Если Объект.ПризнакФормированияБезЗаявки Тогда
		Объект.ЗаявкаОснование = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПризнакФормированияБезЗаявки.Доступность = НЕ ЗначениеЗаполнено(Объект.ЗаявкаОснование);
	Элементы.ЗаявкаОснование.Доступность = НЕ Объект.ПризнакФормированияБезЗаявки;
КонецПроцедуры

&НаКлиенте
Процедура ВидСтавкиОплатыПриИзменении(Элемент)
	
	УстановитьЗаголовокОплатыПоДоговору()
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокОплатыПоДоговору()
	Если Объект.ВидСтавкиОплаты=Перечисления.удуВидыСтавокРодительскойПлаты.Месячная Тогда 
		Элементы.ОплатаПоДоговору.Заголовок="Оплата по договору (руб./мес.)"
	Иначе
		Элементы.ОплатаПоДоговору.Заголовок="Оплата по договору (руб./день)"
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		Если ЗначениеЗаполнено(Объект.Учреждение) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОтбора = Новый Структура("Учреждение",Объект.Учреждение);
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
		ОткрытьФорму("Справочник.удуГруппыУчреждения.ФормаВыбора",ПараметрыФормы,Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Учреждение) тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОтбора = Новый Структура("Учреждение",Объект.Учреждение);
		ПараметрыФормы = Новый Структура("Отбор",ПараметрыОтбора);
		ОткрытьФорму("Документ.удуЗаявкаНаЗачислениеРебенкаВДОУ.ФормаВыбора",ПараметрыФормы,Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчреждениеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Учреждение) Тогда
		Объект.Группа = Объект.Группа.Пустая();
	КонецЕсли;
КонецПроцедуры
